app/Views/v_datausulan_petugas/index.php


                        $db      = \Config\Database::connect();
                        $builder = $db->table('tbl_pegawai');
                        $queryku   = $builder->select('*,tbl_pegawai.tmt_pensiun,count(tbl_pegawai.tmt_pensiun) as jumlah_asn_bup')
                        ->where('tbl_pegawai.jabatan_kode', $jabatankode)
                        ->where('tbl_pegawai.instansi_unor', $instansiunor)
                        ->orderBy('tbl_pegawai.id asc')
                        ->get();
---
SELECT *, `tbl_pegawai`.`tmt_pensiun`, count(tbl_pegawai.tmt_pensiun) as jumlah_asn_bup
FROM `tbl_pegawai`
WHERE `tbl_pegawai`.`jabatan_kode` = '5010'
AND `tbl_pegawai`.`instansi_unor` = 'IH02000000'
ORDER BY `tbl_pegawai`.`id` asc