app/Models/HomeModel.php

	public function get_data_informasi()
	{
		$query =  $this->db->table('tbl_informasi')
			->get();
---
SELECT *
FROM `tbl_informasi`

	public function get_data_alur_pengusulan()
	{
		$query =  $this->db->table('tbl_alur_pengusulan')
			->get();
---
SELECT *
FROM `tbl_alur_pengusulan`

    public function select_time(){
		$query =  $this->db->table('tbl_batas_pengusulan')
			     ->get();
---
SELECT *
FROM `tbl_batas_pengusulan`