app/Models/Opd/DashboardPetugasModel.php

SELECT *
FROM `tbl_login`
JOIN `tbl_petugas` ON `tbl_petugas`.`username` = `tbl_login`.`username`
JOIN `tbl_instansi` ON `tbl_petugas`.`instansi_id` = `tbl_instansi`.`instansi_id`
WHERE `tbl_login`.`username` = 'arsa'
---
	public function getPetugasNamaOpd($username) {
		$query =  $this->db->table('tbl_login')
			->select('*')
			->join('tbl_petugas', 'tbl_petugas.username = tbl_login.username')
			->join('tbl_instansi', 'tbl_petugas.instansi_id = tbl_instansi.instansi_id')
			->where('tbl_login.username', $username)
			->get();