app/Models/Opd/UsulanOPDModel.php

SELECT `tbl_petugas`.`instansi_id`
FROM `tbl_login`
JOIN `tbl_petugas` ON `tbl_petugas`.`username` = `tbl_login`.`username`
WHERE `tbl_login`.`username` = 'arsa'
---
	public function getInstansiByLogin($username)
	{
		$query =  $this->db->table('tbl_login')
		->select('tbl_petugas.instansi_id')
		->join('tbl_petugas', 'tbl_petugas.username = tbl_login.username')
		->where('tbl_login.username', $username)
		->get();

SELECT *, `tbl_pegawai`.`pegawai_nip`, count(tbl_pegawai.pegawai_nip) as jumlahasn, concat(tbl_formasi.jabatan_kode, tbl_formasi.instansi_unor) as jabatan
FROM `tbl_formasi`
LEFT JOIN `tbl_history_usulan` ON `tbl_formasi`.`instansi_unor` = `tbl_history_usulan`.`instansi_unor` and `tbl_formasi`.`jabatan_kode` = `tbl_history_usulan`.`jabatan_kode`
LEFT JOIN `tbl_pegawai` ON `tbl_formasi`.`instansi_unor` = `tbl_pegawai`.`instansi_unor` and `tbl_formasi`.`jabatan_kode` = `tbl_pegawai`.`jabatan_kode`
LEFT JOIN `tbl_jabatan` ON `tbl_formasi`.`jabatan_kode` = `tbl_jabatan`.`jabatan_kode`
LEFT JOIN `tbl_unor` ON `tbl_formasi`.`instansi_unor` = `tbl_unor`.`instansi_unor`
WHERE `tbl_formasi`.`instansi_id` = 'IH'
GROUP BY `jabatan`
ORDER BY `tbl_jabatan`.`jabatan_nama` asc
---
	public function getKebutuhanFormasi($idInstansi)
	{
		$query =  $this->db->table('tbl_formasi')
		->select('*,tbl_pegawai.pegawai_nip,count(tbl_pegawai.pegawai_nip) as jumlahasn,concat(tbl_formasi.jabatan_kode,tbl_formasi.instansi_unor) as jabatan')
		->where('tbl_formasi.instansi_id', $idInstansi)
		->join('tbl_history_usulan', 'tbl_formasi.instansi_unor = tbl_history_usulan.instansi_unor and tbl_formasi.jabatan_kode = tbl_history_usulan.jabatan_kode', 'left')
		->join('tbl_pegawai', 'tbl_formasi.instansi_unor = tbl_pegawai.instansi_unor and tbl_formasi.jabatan_kode = tbl_pegawai.jabatan_kode', 'left')
		->join('tbl_jabatan', 'tbl_formasi.jabatan_kode = tbl_jabatan.jabatan_kode', 'left')
		->join('tbl_unor', 'tbl_formasi.instansi_unor = tbl_unor.instansi_unor', 'left')
		->groupBy('jabatan')
		->orderBy('tbl_jabatan.jabatan_nama asc')
		->get();

SELECT *
FROM `tbl_history_usulan`
LEFT JOIN `tbl_formasi` ON `tbl_formasi`.`instansi_unor` = `tbl_history_usulan`.`instansi_unor` and `tbl_formasi`.`jabatan_kode` = `tbl_history_usulan`.`jabatan_kode`
LEFT JOIN `tbl_jabatan` ON `tbl_history_usulan`.`jabatan_kode` = `tbl_jabatan`.`jabatan_kode`
LEFT JOIN `tbl_unor` ON `tbl_history_usulan`.`instansi_unor` = `tbl_unor`.`instansi_unor`
LEFT JOIN `status_usulan` ON `status_usulan`.`status_usulan_id` = `tbl_history_usulan`.`status_usulan_id`
LEFT JOIN `tbl_instansi` ON `tbl_instansi`.`instansi_id` = `tbl_history_usulan`.`instansi_id`
WHERE `tbl_history_usulan`.`instansi_id` = 'IH'
AND `tbl_history_usulan`.`tahun_usulan` = '2022'
---
	public function getLihatUsulanNow($idInstansi, $tahun_usulan_now)
	{
		$query =  $this->db->table('tbl_history_usulan')
		->select('*')
		->where('tbl_history_usulan.instansi_id', $idInstansi)
		->join('tbl_formasi',  'tbl_formasi.instansi_unor = tbl_history_usulan.instansi_unor and tbl_formasi.jabatan_kode = tbl_history_usulan.jabatan_kode', 'left')
		->join('tbl_jabatan', 'tbl_history_usulan.jabatan_kode = tbl_jabatan.jabatan_kode', 'left')
		->join('tbl_unor', 'tbl_history_usulan.instansi_unor = tbl_unor.instansi_unor', 'left')
		->join('status_usulan', 'status_usulan.status_usulan_id = tbl_history_usulan.status_usulan_id', 'left')
		->join('tbl_instansi', 'tbl_instansi.instansi_id = tbl_history_usulan.instansi_id', 'left')
		->where('tbl_history_usulan.tahun_usulan', $tahun_usulan_now)
		->get();

SELECT *, concat(tbl_formasi.jabatan_kode, tbl_formasi.instansi_unor) as jabatan
FROM `tbl_history_usulan`
LEFT JOIN `tbl_formasi` ON `tbl_formasi`.`instansi_unor` = `tbl_history_usulan`.`instansi_unor` and `tbl_formasi`.`jabatan_kode` = `tbl_history_usulan`.`jabatan_kode`
LEFT JOIN `tbl_jabatan` ON `tbl_formasi`.`jabatan_kode` = `tbl_jabatan`.`jabatan_kode`
LEFT JOIN `tbl_unor` ON `tbl_formasi`.`instansi_unor` = `tbl_unor`.`instansi_unor`
LEFT JOIN `status_usulan` ON `status_usulan`.`status_usulan_id` = `tbl_history_usulan`.`status_usulan_id`
LEFT JOIN `tbl_instansi` ON `tbl_instansi`.`instansi_id` = `tbl_history_usulan`.`instansi_id`
WHERE `tbl_history_usulan`.`instansi_id` = 'IH'
GROUP BY `tbl_history_usulan`.`tahun_usulan`
ORDER BY `tbl_history_usulan`.`tahun_usulan` DESC
---
	public function getLihatUsulanDescYear($idInstansi)
	{
		$query =  $this->db->table('tbl_history_usulan')
		->select('*,concat(tbl_formasi.jabatan_kode,tbl_formasi.instansi_unor) as jabatan')
		->where('tbl_history_usulan.instansi_id', $idInstansi)
		->join('tbl_formasi',  'tbl_formasi.instansi_unor = tbl_history_usulan.instansi_unor and tbl_formasi.jabatan_kode = tbl_history_usulan.jabatan_kode', 'left')
		->join('tbl_jabatan', 'tbl_formasi.jabatan_kode = tbl_jabatan.jabatan_kode', 'left')
		->join('tbl_unor', 'tbl_formasi.instansi_unor = tbl_unor.instansi_unor', 'left')
		->join('status_usulan', 'status_usulan.status_usulan_id = tbl_history_usulan.status_usulan_id', 'left')
		->join('tbl_instansi', 'tbl_instansi.instansi_id = tbl_history_usulan.instansi_id', 'left')
		->groupBy('tbl_history_usulan.tahun_usulan')
		->orderBy('tbl_history_usulan.tahun_usulan DESC')
		->get();

SELECT *, concat(tbl_formasi.jabatan_kode, tbl_formasi.instansi_unor) as jabatan
FROM `tbl_detail_usulan`
LEFT JOIN `tbl_usulan` ON `tbl_usulan`.`usulan_id` = `tbl_detail_usulan`.`usulan_id`
LEFT JOIN `tbl_formasi` ON `tbl_formasi`.`instansi_unor` = `tbl_detail_usulan`.`instansi_unor` and `tbl_formasi`.`jabatan_kode` = `tbl_detail_usulan`.`jabatan_kode`
LEFT JOIN `tbl_jabatan` ON `tbl_formasi`.`jabatan_kode` = `tbl_jabatan`.`jabatan_kode`
LEFT JOIN `tbl_unor` ON `tbl_formasi`.`instansi_unor` = `tbl_unor`.`instansi_unor`
LEFT JOIN `status_usulan` ON `status_usulan`.`status_usulan_id` = `tbl_detail_usulan`.`status_usulan_id`
LEFT JOIN `tbl_instansi` ON `tbl_instansi`.`instansi_id` = `tbl_usulan`.`instansi_id`
WHERE `tbl_usulan`.`instansi_id` = 'IH'
AND `tbl_usulan`.`tahun_usulan` = '2022'
ORDER BY `tbl_usulan`.`tahun_usulan` DESC
---
	public function getStatusUsulan($idInstansi, $tahun_usulan_now)
	{
		$query =  $this->db->table('tbl_detail_usulan')
		->select('*,concat(tbl_formasi.jabatan_kode,tbl_formasi.instansi_unor) as jabatan')
		->join('tbl_usulan',  'tbl_usulan.usulan_id = tbl_detail_usulan.usulan_id', 'left')
		->where('tbl_usulan.instansi_id', $idInstansi)
		->join('tbl_formasi',  'tbl_formasi.instansi_unor = tbl_detail_usulan.instansi_unor and tbl_formasi.jabatan_kode = tbl_detail_usulan.jabatan_kode', 'left')
		->join('tbl_jabatan', 'tbl_formasi.jabatan_kode = tbl_jabatan.jabatan_kode', 'left')
		->join('tbl_unor', 'tbl_formasi.instansi_unor = tbl_unor.instansi_unor', 'left')
		->join('status_usulan', 'status_usulan.status_usulan_id = tbl_detail_usulan.status_usulan_id', 'left')
		->join('tbl_instansi', 'tbl_instansi.instansi_id = tbl_usulan.instansi_id', 'left')
		->where('tbl_usulan.tahun_usulan', $tahun_usulan_now)
		->orderBy('tbl_usulan.tahun_usulan DESC')
		->get();